/***********************************************************
请编写一个程序，输入三个整数，要求实现对这三个整数进行排序
************************************************************
算法思想：
	由用户输入3个数，选择排序方式，0由小到大，1由大到小。
	通过简单的选择判断进行排序。
***********************************************************/
#include "stdAfx.h"
#include<stdio.h>
int main()
{
	int x, y, z, n;
	scanf("%d%d%d", &x, &y, &z);
	if (x>y){ n = x; x = y; y = n; }
	if (x>z){ n = x; x = z, z = n; }
	if (y>z){ n = z; z = y; y = n; }
	printf("%d,%d,%d", x, y, z);
	return 0;
}
