/*******************************************************
请编写一个程序，输入一个M行N列的二维数组，要求打印出该
二维数组的转置
********************************************************
算法思想：
	将每列数据当做一行输出，总共输出N行数据，借用中间赋值关系进行转置。
*******************************************************/
#include<stdio.h>
#define M 4
#define N 5
void main()
{
	int a[M][N] = { { 1, 2, 3, 4, 5 }, { 6, 7, 8, 9, 10 }, { 11, 12, 13, 14, 15 }, { 16, 17, 18, 19, 20 } };
	int b[N][M];
	int i, j;
	for (i = 0; i<M; i++)
	for (j = 0; j<N; j++)
		b[j][i] = a[i][j];
	printf("reverse before:\n");
	for (i = 0; i<M; i++)
	{
		for (j = 0; j<N; j++)
			printf("%2d ", a[i][j]);
		printf("\n");
	}
	printf("reverse after:\n");
	for (i = 0; i<N; i++)
	{
		for (j = 0; j<M; j++)
			printf("%2d ", b[i][j]);
		printf("\n");
	}
}
