/********************************************************
汉诺塔求解
*********************************************************
*********************************************************
通过递归将大问题转换成小问题，将所用问题都是转化成移动三个盘子的问题。
********************************************************/
#include<stdio.h>
inline int move(char A,char B)
{	//输出移动起点和目的地
	printf("%c-->%c \n",A,B);
	return 0;
}
int hanno(int n,char A,char B,char C)
{	//n为移动层数，A为起点，B为中介，C为目的地
	if( n==1 )
		move(A,C);	//递归出口，移动到目的地
	else
	{
		hanno(n-1,A,C,B);	//前n-1层A移到B
		move(A,C);			//底层A到C
		hanno(n-1,B,A,C);	//前n-1层B移到C
	}
	return 0;
}
int main()
{
	int n;
	printf("输入汉诺塔层数：");
	scanf("%d",&n);
	hanno(n,'A','B','C');
	return 0;
}