/**********************************************************
随意输入一串字符，统计字符串里大写字母 小写字母与数字的个数
***********************************************************
算法思想：
	随意输入，不能规定字符数上限，无法用数组。所以单个字符
进行判断，并定义3个变量，分别代表小写字母、大写字母、数字的
个数。逐个字符进行统计。通过循环判定。
**********************************************************/
#include "stdafx.h"
#include <stdio.h>
#include <string.h>
void main()
{
	char s[100];
	int i, dx, xx;
	dx = 0;
	xx = 0;

	printf("请输入字符串");
	scanf("%s", &s);
	for (i = 0; i<strlen(s); i++)
	{
		if (s[i] <= 'z'&&s[i] >= 'a')
			xx++;
		else
			dx++;
	}

	printf("大写字母%d个\n小写字母%d个", dx, xx);

}
