/***********************************************************
你只需要把这句很重要的话 -- "I Love GPLT"--竖着输出就可以了。
所谓"竖着输出"，是指每个字符占一行（包括空格），即每行只能有
1个字符和回车。
************************************************************
算法思想：
	无算法，直接输出。
***********************************************************/
#include "stdafx.h"
#include<stdio.h>
int main(void)
{

	printf("I\n");
	printf(" \n");
	printf("L\n");
	printf("o\n");
	printf("v\n");
	printf("e\n");
	printf(" \n");
	printf("G\n");
	printf("P\n");
	printf("L\n");
	printf("T\n");
	return 0;
}
