/***************************************************************
625 这个数字很特别，625 的平方等于390625,刚好其末3 位是625 本身。
除了625,还有其它的3 位数有这个特征吗?请编写程序，寻找所有这样的
3 位数:它的平方的末3 位是这个数字本身。输出结果中，从小到大，每
个找到的数字占- 一行。比如那个625就输出为: 625
****************************************************************
算法思想：
	通过对数字与最后三位对比，在通过循环一个个判定是否是相同。
***************************************************************/
#include "stdafx.h"
#include<iostream>
using namespace std;
int main()
{
	int a, b, c, d, e, f;
	for (a = 100; a<1000; a++)
	{
		b = a*a;
		c = b / 100000;
		d = (b - c * 100000) / 10000;
		e = (b - c * 100000 - d * 10000) / 1000;
		f = b - c * 100000 - d * 10000 - e * 1000;


		if (a == f)
		{
			cout << a << "*" << a << "=" << b << endl;
			cout << a << endl;
		}
	}
	return 0;
}
