/*******************************************************
要求键盘随便输入一个十进制数然后转换成十六进制数打印出来
********************************************************
算法思想：
	通过showhex函数，直接将十进制转换一个十六进制数，通过主函数输出。
*******************************************************/
#include "stdafx.h"
#include<stdio.h>  

void showhex(int n)
{
	if (n>15){
		showhex(n / 16);
		printf(" ");
	}
	printf("%d", n % 16);
}
int main()
{
	int a;
	printf("input a num:");
	scanf("%d", &a);
	showhex(a);
	printf("\n");
}
